app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 231], ["created_at", "2017-10-17 01:33:06.979048"], ["updated_at", "2017-10-17 01:33:06.979048"]]
---
  def create
    @school_class = SchoolClass.new(school_params)
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-10-17 01:39:09.871922"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_params)